{
  "backend/main.mo": "Main Motoko actor implementing a news article system with user profiles, role-based access control (admin/user permissions), CRUD operations for articles, pagination, category filtering, and share count tracking.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including news feed display, category filtering, pagination, share functionality, and visual theme design with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and utilities for the FlashTrend news application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system using warm colors (orange, red, yellow, green) and design tokens for light/dark themes.",
  "frontend/index.html": "HTML entry point for the FlashTrend React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with news feed and admin routes, theme provider, and conditional profile setup modal for authenticated users without profiles.",
  "frontend/src/components/CategoryIcon.tsx": "Component rendering category-specific icons from generated assets based on the Category enum value.",
  "frontend/src/components/CategoryTabs.tsx": "Tab navigation component for filtering news articles by category (All, Politics, Viral, Trending, Social) with icons and active state styling.",
  "frontend/src/components/CreateArticleForm.tsx": "Admin form component for creating news articles with validation, 280-character summary limit with counter, category selection with icons, and toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, hero section, and footer; handles authentication, navigation, and admin access using Internet Identity and React Router.",
  "frontend/src/components/NewsCard.tsx": "Displays a single news article card with category badge, title, summary, timestamp, and share functionality; includes clipboard copy and share count tracking.",
  "frontend/src/components/PaginationControls.tsx": "Simple pagination UI component with previous/next buttons and current page display.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile creation, prompting for name input with form validation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, handling identity changes and admin token initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and delegation management.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend operations including user profiles, admin checks, article fetching/creation, and share functionality.",
  "frontend/src/hooks/useShareArticle.ts": "Wrapper hook around the share article mutation that provides a simplified interface with success/error callbacks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using CSS variables for light/dark themes and category-specific colors (orange, red, yellow, green spectrum).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin page component that checks authentication and admin permissions, displaying CreateArticleForm for authorized admins or appropriate error messages for unauthorized users.",
  "frontend/src/pages/NewsFeedPage.tsx": "Main news feed page that displays paginated articles with category filtering, requiring authentication and showing loading states, error alerts, or article cards in a responsive grid.",
  "frontend/src/utils/timeFormat.ts": "Utility function that converts nanosecond timestamps to human-readable relative time strings like 'just now', '5 minutes ago', or formatted dates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, brand-specific colors for categories (politics, viral, trending, social), animations, and responsive container settings.",
  "project_state.json": "Project metadata defining FlashTrend as a fast short-news application with implemented features including news feed, category filtering, pagination, sharing, admin interface, and distinctive visual theme."
}